Revit 2027 API
MultiSegmentGrid.IsValidCurveLoop Method
 Identifies whether the specified curve loop is valid for creation of a MultiSegmentGrid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidCurveLoop(
	CurveLoop curveLoop
)
Public Shared Function IsValidCurveLoop (
	curveLoop As CurveLoop
) As Boolean
public:
static bool IsValidCurveLoop(
	CurveLoop^ curveLoop
)
static member IsValidCurveLoop :
        curveLoop : CurveLoop -> bool
Parameters
curveLoop CurveLoop
 The curve loop.
Return Value
Boolean
 True if the curve loop is an open curve loop consisting of lines and arcs, and false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
MultiSegmentGrid Class
Autodesk.Revit.DB Namespace